app/Models/M_Dosen.php

SELECT *
FROM `dosen`
---
  public function getDataDosen()
  {
    return $this->findAll();